
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.api.azurerm_api_management_api.api
  * module.api.azurerm_api_management_product_api.link_to_product[0]
  * module.em-icp-api.azurerm_api_management_product.product
  * module.policy.azurerm_api_management_api_policy.api_policy
* Update
  * module.em-icp-redis-cache[0].azurerm_redis_cache.redis
* Delete
  * azurerm_web_pubsub_hub.icpHub


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_web_pubsub_hub.icpHub will be destroyed
  # (because azurerm_web_pubsub_hub.icpHub is not in configuration)
  - resource "azurerm_web_pubsub_hub" "icpHub" {
      - anonymous_connections_enabled = true -> null
      - id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-aat/providers/Microsoft.SignalRService/webPubSub/em-icp-webpubsub-aat/hubs/icpHub" -> null
      - name                          = "icpHub" -> null
      - web_pubsub_id                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-aat/providers/Microsoft.SignalRService/webPubSub/em-icp-webpubsub-aat" -> null

      - event_handler {
          - system_events      = [
              - "connect",
              - "connected",
              - "disconnected",
            ] -> null
          - url_template       = "https://em-icp.aat.platform.hmcts.net/eventhandler" -> null
          - user_event_pattern = "*" -> null
        }
    }

  # module.api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "core-api-mgmt-aat"
      + api_type              = "http"
      + display_name          = "em-icp"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "em-icp-api"
      + path                  = "em-icp-api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "core-infra-aat"
      + revision              = "1"
      + service_url           = "http://em-icp-aat.service.core-compute-aat.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/em-icp.json"
        }
    }

  # module.api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "core-api-mgmt-aat"
      + api_name            = "em-icp-api"
      + id                  = (known after apply)
      + product_id          = "em-icp-api"
      + resource_group_name = "core-infra-aat"
    }

  # module.em-icp-api.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "core-api-mgmt-aat"
      + approval_required     = true
      + display_name          = "em-icp-api"
      + id                    = (known after apply)
      + product_id            = "em-icp-api"
      + published             = true
      + resource_group_name   = "core-infra-aat"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.em-icp-redis-cache[0].azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-redis-cache-cache-aat/providers/Microsoft.Cache/redis/em-icp-redis-cache-aat"
        name                          = "em-icp-redis-cache-aat"
        tags                          = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (14 unchanged attributes hidden)
        }
    }

  # module.policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "core-api-mgmt-aat"
      + api_name            = "em-icp-api"
      + id                  = (known after apply)
      + resource_group_name = "core-infra-aat"
      + xml_content         = <<-EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
                    <choose>
                        <when condition="@(context.Request.Certificate == null)" >
                            <return-response>
                                <set-status code="401" />
                                <set-body>Missing client certificate</set-body>
                            </return-response>
                        </when>
                        <when condition="@(context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;&quot;,&quot;29390B7A235C692DACD93FA0AB90081867177BEC&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                            <return-response>
                                <set-status code="401" />
                                <set-body>Invalid client certificate</set-body>
                            </return-response>
                        </when>
                    </choose>
                    <rate-limit-by-key calls="3" renewal-period="15" counter-key="@(context.Subscription.Id)" />
                </inbound>
                <outbound>
                    <base/>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1210,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->